<html>

<body>

<h2>Questions fr&eacute;quemment pos&eacute;es</h2>

<a name="Sommaire">
<p>
<ol>
 <li> <a Href="#1">Qu'est ce que c'est que GenJ. A quoi peut il servir ?</a>
 <li> <a Href="#2">Y a t'il une forum de discussion concernant GenJ ?</a>
 <li> <a Href="#3">Que veut dire le mot Gedcom ?</a>
 <li> <a Href="#4">Comment puis-je pr&eacute;senter des images ou photos 
 dans mon Arbre G&eacute;n&eacute;alogique ?</a>
 <li> <a Href="#5">Comment puis-je faire pour que GenJ utilise un autre 
 langage ?</a>
 <li> <a Href="#6">Comment puis-je faire pour qu'un centim&egrave;tre ait cette 
 taille sur mon &eacute;cran ?</a>
 <li> <a Href="#7">Je voudrais que GenJ ait un autre look. Comment faire ?</a>
 <li> <a Href="#8">Comment associer des enregistrements existants (une personne 
 vis &agrave; vis d'une autre personne par exemple) ?</a>
 <li> <a Href="#9">Comment puis-je &ecirc;tre en contact avec les autres 
 utilisateurs de GenJ et les d&eacute;veloppeurs ? O&ugrave; puis-je avec 
 avoir de plus amples informations &agrave; propos de GenJ ?</a>
 </ol>
<Table Width="100%" Border="0">
  <Tr>
    <Td Width="60%">
      &nbsp;<Br>
    </Td>
    <Td Width="40%">
      <p align="left">
        <Font size="-2">
          En cliquant sur la lettre "<Font color="red">Q</Font>" en 
          rouge situ&eacute;e en face de chaque question, vous pouvez 
          remonter au sommaire de ces diff&eacute;rentes questions.<Br>
        </Font>
      </p>
    </Td>
  </Tr>
</Table>
</p>


<Center>
  -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
</Center>


<ol>

<a name="1">
<p>
<li>
  <b><a Href="#Sommaire"><Font color="red">Q</Font></a></b>&nbsp;-&nbsp;<u>Qu'est-ce 
  que c'est que GenJ&nbsp;?</u><br>
  <b>R</b>&nbsp;-&nbsp;GenealogyJ (en abr&eacute;g&eacute; GenJ) est un 
  visualiseur et un &eacute;diteur de donn&eacute;es g&eacute;n&eacute;alogiques 
  stock&eacute;es dans le format Gedcom.
</p>

<a name="2">
<p>
<li>
  <b><a Href="#Sommaire"><Font color="red">Q</Font></a></b>&nbsp;-&nbsp;<u>Y 
  a t'il une forum de discussion concernant GenJ&nbsp;?</u><br>
  <b>R</b>&nbsp;-&nbsp;Oui, ce forum de discussion existe. Vous pouvez 
  nous y rejoindre <a href="http://genj.sourceforge.net/forum">ici</a> 
  (forum de discussion@genj.sourceforge.net)<Br>
  Il existe &eacute;galement un canal IRC sur le serveur 
  <b>irc.freenode.net</b> canal <b>#genj</b>. D'autres utilisateurs ou/et 
  d&eacute;veloppeurs peuvent y &ecirc;tre pr&eacute;sents.
</p>

<a name="3">
<p>
<li>
  <b><a Href="#Sommaire"><Font color="red">Q</Font></a></b>&nbsp;-&nbsp;<u>Que 
  veut dire le mot Gedcom&nbsp;?</u><br>
  <b>R</b>&nbsp;-&nbsp;Lisez les explications <a href="./../concepts/gedcom.html">ici</a>.
</p>

<a name="4">
<p>
<li>
  <b><a Href="#Sommaire"><Font color="red">Q</Font></a></b>&nbsp;-&nbsp;<u>Comment 
  puis-je pr&eacute;senter des images ou photos dans mon Arbre 
  G&eacute;n&eacute;alogique&nbsp;?</u><br>
  <b>R</b>&nbsp;-&nbsp;Pour montrer la photo d'une personne dans la vue 
  principale de l'Arbre G&eacute;n&eacute;alogique ajoutez une propri&eacute;t&eacute; 
  multim&eacute;dia (OBJE) &agrave; vos individus. Allez simplement sur un individu 
  dans la </a><a href="../view/edit.html">fen&ecirc;tre d'Edition</a>, 
  choisissez la propri&eacute;t&eacute; premi&egrave;re INDI, cliquez sur 
  '+' et choisissez OBJE &agrave; ajouter. Pointez la 
  sous-propri&eacute;t&eacute; FILE vers un fichier dans le gestionnaire 
  de fichiers de votre ordinateur (bouton '&gt;&gt;') et les images 
  seront int&eacute;gr&eacute;es par la Visualisation de 
  <a href="../view/tree.html">l'Arbre G&eacute;n&eacute;alogique</a> (elle 
  recherche automatiquement l'information INDI:OBJE:FILE).
</p>

<a name="5">
<p>
<li>
  <b><a Href="#Sommaire"><Font color="red">Q</Font></a></b>&nbsp;-&nbsp;<u>Comment 
  puis-je faire pour que GenJ utilise un autre langage&nbsp;?</u><br>
  <b>R</b>&nbsp;-&nbsp;T&eacute;l&eacute;chargez le pack langage appropri&eacute; 
  (genj_ll-x.y.zip) pour GenJ (c.a.d genj_fr-2.0.zip) depuis la 
  <a target="project" href="http://genj.sourceforge.net">Page Principale du 
  Projet</a> et suivez les instructions d&eacute;crivant son installation. GenJ 
  essaiera d'utiliser le langage de votre syst&egrave;me automatiquement. 
  Pour changer intentionnellement de langage (le pack langage doit &ecirc;tre 
  install&eacute; manuellement) choisissez le menu <em>Visualisation</em>, puis 
  le sous-menu <em>Options</em>. 
  Ensuite s&eacute;lectionnez le langage de votre choix.<Br>
  Vous devrez red&eacute;marrer GenJ, pour que cela soit pris en consid&eacute;ration.
</p>

<a name="6">
<p>
<li>
  <b><a Href="#Sommaire"><Font color="red">Q</Font></a></b>&nbsp;-&nbsp;<u>Comment 
  puis-je faire pour qu'un centim&egrave;tre ait cette taille sur mon 
  &eacute;cran&nbsp;?</u><br>
  <b>R</b>&nbsp;-&nbsp;GenJ utilise le syt&egrave;me m&eacute;trique 
  mondial pour de nombreux composants (par ex. dans la Visualisation de 
  </a><a href="../view/tree.html">l'Arbre G&eacute;n&eacute;alogique</a>). 
  Pour que les longueurs de lignes et les tailles des bo&icirc;tes apparaissent 
  correctement sur votre &eacute;cran, vous aurez &agrave; indiquer &agrave; 
  GenJ votre r&eacute;solution d'&eacute;cran (qui est donn&eacute;e par le 
  syst&egrave;me mais normalement ne vous occupez pas des 
  param&egrave;tres syst&egrave;me du moniteur). Pour ajuster 
  explicitement la r&eacute;solution choisissez le sous menu du menu <em>Aide|A 
  propos </em>et allez &agrave; l'onglet <em>Apparence</em>. Ensuite 
  utilisez une r&egrave;gle correspondante &agrave; celles 
  montr&eacute;es pour votre &eacute;cran.
</p>

<a name="7">
<p>
<li>
  <b><a Href="#Sommaire"><Font color="red">Q</Font></a></b>&nbsp;-&nbsp;<u>Je 
  voudrais que GenJ ait un autre look. Comment faire&nbsp;?</u><br>
  <b>R</b>&nbsp;-&nbsp;GenJ utilises la boite d'Outils Swing pour 
  pr&eacute;senter les informations &agrave; l'utilisateur. Celle-ci 
  par d&eacute;faut est grise - elle est appel&eacute;e <em>Metal</em>. 
  GenJ  permet de changer l'Apparence courante. T&eacute;l&eacute;chargez 
  le pack Apparence&nbsp;(genj_lnf-x.y.zip) depuis la page des projets de 
  <a target="project" href="http://genj.sourceforge.net">GenJ</a> 
  et suivez les instructions d&eacute;crivant son installation.
  Apr&egrave;s avoir red&eacute;marr&eacute; GenJ choisissez
  le menu <em>Visualisation</em> et allez dans le sous-menu <em>Options</em>, 
  choisissez la langue que vous voulez. Maintenant, vous pouvez 
  s&eacute;lectionner une Apparence (et &eacute;ventuellement un 
  Th&egrave;me).
</p>

<a name = "8">
<p>
<li>
 <b><a Href="#Sommaire"><Font color="red">Q</Font></a></b>&nbsp;-&nbsp;<u>J'ai 
 une personne que j'ai d&eacute;j&agrave; cr&eacute;&eacute;e et je voudrais 
 faire en sorte qu'elle soit consid&eacute;r&eacute;e comme l'enfant d'une 
 autre personne de mon arbre. La seule option que j'imagine est d'ajouter 
 un nouvel enfant/parent &agrave; un enregistrement d&eacute;j&agrave; 
 cr&eacute;&eacute;, mais il ne semble pas exister une option pour ajouter 
 une personne d&eacute;j&agrave; cr&eacute;&eacute;e en tant que parent 
 ou enfant d'une autre personne. Comment puis je faire &ccedil;a&nbsp;?</u><br>
 <b>R</b>&nbsp;-&nbsp;Tu cliques sur la personne sur laquelle tu veux 
 ajouter l'enfant. L&agrave; tu cliques droit sur cette personne, tu 
 choisis 'Individu xxxx', et dans le menu d&eacute;roulant, tu prends 
 'cr&eacute;er un(e) Enfant', et dans le menu qui s'ouvre, tu choisis 
 la personne de ton choix dans le menu d&eacute;roulant qui t'est 
 propos&eacute;.<Br>
 De cette fa&ccedil;on, aucune personne nouvelle ne sera cr&eacute;&eacute;e 
 comme enfant de cette personne, mais un lien va &ecirc;tre &eacute;tabli 
 entre les deux individus en question.
</p>

<a name = "9">
<p>
<li>
 <b><a Href="#Sommaire"><Font color="red">Q</Font></a></b>&nbsp;-&nbsp;<u>Comment 
 puis-je &ecirc;tre en contact avec les autres utilisateurs de GenJ et 
 les d&eacute;veloppeurs&nbsp;? O&ugrave; puis-je avec avoir de plus amples 
 informations &agrave; propos de GenJ&nbsp;?</u><br>
 <b>R</b>&nbsp;-&nbsp;Faites un tour sur :<Br>
 &nbsp;&nbsp;&nbsp;&nbsp;-&nbsp; le <a href="http://genj.sourceforge.net">Site Internet de GenJ</a>, <Br>
 &nbsp;&nbsp;&nbsp;&nbsp;-&nbsp; le <a href="http://sourceforge.net/projects/genj">Site de d&eacute;veloppement 
 de GenJ</a>, <Br>
 &nbsp;&nbsp;&nbsp;&nbsp;-&nbsp; et le canal IRC&nbsp;:&nbsp;<b><font color=orange>#genj</font></b> sur 
 <b><font color="orange">irc.freenode.net</font></b>.
</p>

</ol>


<Br>

</body>
</html>

