<HTML>
<BODY>

<H2>
  ResEdit - L'&Eacute;diteur de Ressources
</H2>

<P>
ResEdit est un programme externe &agrave; GenJ qui va vous servir &agrave; 
traduire les ressources (les fichiers langages) en d'autres langues (ex. les 
traduire en fran&ccedil;ais, espagnol, etc....)
</P>

<P>
<H3>De quoi avez-vous besoin pour l'utiliser?</H3>
Tout d'abord vous devez cr&eacute;er un fichier de lancement que vous appellerez 
par exemple <i>resedit</i> (si vous &ecirc;tes sous Linux), ou <i>resedit.cmd</i> 
(si vous &ecirc;tes sous OS/2), etc...
</P>

<P>
A l'int&eacute;rieur, mettez les commandes suivantes (l'exemple qui suit 
concerne Linux, aussi, modifiez les pour que cela corresponde &agrave; 
votre syst&egrave;me, bien s&ucirc;r)&nbsp;:
</P>

<Ul>
<b>
<font size="-2">#!/bin/sh<Br>
	#<Br>
	<Br>
	# Les deux lignes qui suivent sont les seules que vous devez changer<Br> 
  # pour adapter ce script &agrave; votre syst&egrave;me<Br>
	JAVA_HOME=/usr/local/jdk1.2.2<Br>
	GENJ_HOME=/home/fm/genj<Br>
	<Br>
	echo "/*"<Br>
	echo " * Resource Editor startup file for Genj"<Br>
	echo " * "<Br>
	echo " * If something goes wrong now you probably have an"<Br>
	echo " * incomplete CLASSPATH. Either copy swing.jar to"<Br>
	echo " * your lib sub-directory or specify its location via"<Br>
	echo " * (e.g.) export CLASSPATH=/usr/lib/swing/swing.jar"<Br>
	echo " * before starting this script."<Br>
	echo " */"<Br>
	<Br>
	export CLASSPATH=./lib/resedit.jar:./lib/swing.jar:$CLASSPATH<Br>
	export PATH=$JAVA_HOME/bin:$PATH<Br>
	<Br>
	cd $GENJ_HOME<Br>
	$JAVA_HOME/bin/java com.nm.resedit.Main<Br>
</font>
</b>
</Ul>

Pour lancer votre &eacute;diteur de ressources, tout ce que vous avez &agrave; 
faire est d'&eacute;x&eacute;cuter le fichier de d&eacute;marrage que vous venez 
de cr&eacute;er, en tapant "resedit".<Br>
Apr&eacute;s avoir cliqu&eacute; sur le bouton OPEN une fois resedit 
d&eacute;marr&eacute;, choisissez une archive support <i>(ex. genj.jar)</i> 
mais regardez le N.B. ci-dessous.<Br> 
Vous pouvez alors, soit traduire les textes existants en chargeant 
une traduction, soit naviguer &agrave; travers les textes manuellement.<Br>
Dans cette deuxi&egrave;me hypoth&egrave;se, vous devez choisir dans la 
fen&ecirc;tre de gauche, un chapitre (qui d'ailleurs correspond &agrave; un 
r&eacute;pertoire) pour d&eacute;marrer la traduction. Ensuite, dans la 
fen&ecirc;tre de droite, vous choisissez une ligne &agrave; traduire et vous 
tapez la traduction dans le champ de saisie en bas de l'&eacute;cran.<Br>
Si vous d&eacute;sirez charger une traduction, cliquez sur l'icone "translate" 
(traduction) dans le menu principal, puis s&eacute;lectionnez le fichier 
d&eacute;j&agrave; traduit (il peut n'&ecirc;tre traduit que partiellement) 
que vous voulez &eacute;diter/modifier (<i>ex. genj_fr.zip</i>). Une fois 
s&eacute;lectionn&eacute;, d&eacute;cochez l'option "Default local or ..." 
et choisissez le param&egrave;tre local appropri&eacute; &agrave; la langue 
&agrave; laquelle s'applique le fichier (dans mon exemple, il faut choisir 
"<i>fr</i>"). Une fois cela fait, vous devez cliquer sur le bouton de 
traduction (translate).

<Ul>
	<b>N.B.</b> A partir de GenJ v. 1.7 et Resedit 0.02, il vaut mieux ouvrir 
  le fichier <i>genj_en.zip</i> plut&ocirc;t que le <i>genj.jar</i>. Aussi, 
  cliquez d'abord sur le bouton ouvrir (open), puis s&eacute;lectionnez 
  genj_en.zip. Une fois que c'est fait, cliquez sur le bouton de traduction 
  (translate), et s&eacute;lectionnez le fichier d&eacute;j&agrave; traduit 
  (il peut n'&ecirc;tre traduit que partiellement) que vous voulez 
  &eacute;diter/modifier etc...(voir au-dessus).<Br>
</Ul>

<Center>
	<IMG src="../../images/Resedit.jpg"></IMG>
</Center>

<Br>

Apr&eacute;s avoir traduit les lignes de texte, vous pouvez sauvegarder 
(SAVE) le r&eacute;sultat dans un fichier compress&eacute; au format ZIP 
ou JAR. Vous devez indiquer &agrave; quel param&egrave;tre local vous faites 
r&eacute;f&eacute;rence lorsque vous chargez (LOAD), traduisez (TRANSLATE) 
ou sauvegardez (SAVE). Cela correspond &agrave; une structure de fichier 
du genre resources_xyz.properties qui est alors utilis&eacute; par le 
logiciel qui charge ces ressources nouvellement traduites. Le nom des 
fichiers que vous chargez et sauvegardez n'a pas d'importance pour 
Java - Le param&egrave;tre local que vous choisissez est utilis&eacute; 
&agrave; l'int&eacute;rieur de l'archive seulement. Cependant pour que 
tout le monde s'y retrouve il est plus simple de les identifier avec 
une d&eacute;nommination du genre genj_XY.zip (o&ugrave; XY est 
l'abr&eacute;viation du param&egrave;tre local ins&eacute;r&eacute; - 
ex. genj_fr.zip).<Br>

<Table border=0>
	<Tr>
		<Td>
			<b>Notes</b> :
		</Td>
	</Tr>
	<Tr>
		<Td>	
			<dd>-&nbsp;Pour Java 1.1: Vous devez avoir une librairie swing.jar 
			dans votre "classpath".
		</Td>
	</Tr>
	<Tr>
		<Td>		
			<dd>-&nbsp;Et j'ai &eacute;galement remarqu&eacute; que pour que 
      Resedit (v. 0.01) fonctionne, les fichiers genj.jar et genj_XY.zip 
      doivent &ecirc;tre plac&eacute;s dans le r&eacute;pertoire principal 
      de GenJ, et non dans le sous-r&eacute;pertoire /genj/lib.
		</Td>
	</Tr>
</Table>

<P>
<H3>Quels fichiers sont disponibles?</H3>
Au jour o&ugrave; je traduis cette aide, les fichiers de ressources suivants 
sont disponibles&nbsp;:
<Ul>
	<li> Fichier de ressources <b>Allemand</b> : genj_de.zip
	<li> Fichier de ressources <b>Anglais</b> : genj_en.zip
	<li> Fichier de ressources <b>Fran&ccedil;ais</b> : genj_fr.zip
	<li> Fichier de ressources <b>Hollandais</b> : pas encore
	<li> Fichier de ressources <b>Italien</b> : genj_it.zip
	<li> Fichier de ressources <b>Japonais</b> : genj_ja.zip
</Ul>
<font size="-2">(Les fichiers langage Anglais, Allemand, et Fran&ccedil;ais sont 
en g&eacute;n&eacute;ral mis &agrave; jour avec chaque nouvelle version de 
GenJ)</Font>
</P>

<Br><Br>

</BODY>
</HTML>
