<HTML>
<BODY>

<H2>
  Les Param&egrave;tres d'Affichage de l'Arbre G&eacute;n&eacute;alogique
</H2>

<P>
Vous pouvez changer &eacute;normement de choses pour adapter &agrave; 
vos besoins la mani&egrave;re dont l'affichage de 
<A href="../tree.html">l'arbre g&eacute;n&eacute;alogique</A> va se faire.
Les param&egrave;tres sont regroup&eacute;s autour de trois onglets 
d&eacute;crits ci-apr&eacute;s.
</P>

<P>
N'oubliez pas d'appuyer sur "Appliquer" quand vous aurez fini!
</P>

<P>
<H3>Propri&eacute;t&eacute;s</H3>
Ici vous allez sp&eacute;cifier quelles propri&eacute;t&eacute;s vous 
souhaitez voir s'afficher dans les cadres de l'arbre g&eacute;n&eacute;alogique. 
Tout d'abord, s&eacute;lectionnez un type dans le menu d&eacute;roulant 
(ex. Individus). Ensuite cochez toutes les propri&eacute;t&eacute;s qui 
vous int&eacute;ressent dans l'arborescence situ&eacute;e en dessous. 
Enfin r&eacute;arrangez la mani&egrave;re dont vous voulez que ces 
propri&eacute;t&eacute;s soient affich&eacute;es, dans le cadre du bas - 
c'est un petit peu d&eacute;licat parce que vous pouvez redimensionner 
et repositionner ces champs &agrave; la pixel pr&eacute;s. En 
d&eacute;pla&ccedil;ant la r&eacute;glette sur le c&ocirc;t&eacute; 
droit, vous pouvez activer une grille pour vous aider dans ce 
positionnement.
</P>

<P>
<H3>Options</H3>
Choisissez un niveau de zoom en cliquant sur l'&eacute;chelle. Vous 
pouvez aussi activer/d&eacute;sactiver un certain nombre d'options&nbsp;:<Br>
- afficher un ombrage,<Br>
- afficher les icones de propri&eacute;t&eacute;,<Br>
- Appliquer le zoom aux images (attention cela utilise pas mal de 
ressources syst&egrave;me surtout quand vous zoomez et que l'arbre est 
affich&eacute; en arborescence horizontale ou verticale),<Br>
- afficher des dates abr&eacute;g&eacute;es.<Br>
Enfin un choix de fontes (type et taille) vous est offert.
</P>

<P>
<H3>Signets</H3>
Un signet est un raccourci vers un endroit que l'on souhaite voir 
comme origine de l'arbre. S&eacute;lectionnez une entit&eacute; dans 
n'importe quelle fen&ecirc;tre de visualisation (la premi&egrave;re 
ligne nous indique qu'il pointe bien sur cette entit&eacute; - ex. 
si c'est une personne que l'on a choisie, vous verrez quelque chose 
du genre I006:Doe, John) et donnez un nom &agrave; ce signet dans 
la zone de saisie. Ensuite ajoutez le &agrave; la liste des signets 
de cette mani&egrave;re il appara&icirc;tra dans le menu d&eacute;roulant 
des signets de la fen&ecirc;tre de visualisation de l'arbre 
g&eacute;n&eacute;alogique, en bas &agrave; droite. Vous pouvez 
&eacute;galement effacer et r&eacute;organiser les signets en les 
d&eacute;pla&ccedil;ant vers le haut ou vers le bas, comme vous le 
souhaitez.
</P>

<Br>

</BODY>
</HTML>

