<html>

<body>

<div class=Section1>

<h2><a href="..\views.html">Ansichten</a> - Editier-Ansicht</h2>

<table><tr><td>

  <p>
Wie im Abschnitt zu <a href="..\concepts\gedcom.html">Gedcom</a> angesprochen, besteht eine Instanz aus einer Hierachie von Eigenschaften und dazugeh&ouml;rigen Werten. Nach dem &Ouml;ffnen der Editier-Ansicht f&uuml;hrt sie alle Selektionen aus, selbst wenn sie in anderen Ansichten get&auml;tigt wurden. Es wird die Eigenschafts-Hierarchie der gew&auml;hlten Instanz einschlie&szlig;lich der Symbole, Kennzeichen und Werte angezeigt.
</p>

<p>
Erkunden sie die Eigenschafts-Hierarchie und benutzen Sie wenn n&ouml;tig die Bildlaufleisten auf der rechten Seite und am unteren Rand. Beim Klicken auf eine Eigenschaft erscheint in der unteren Bildschirmh&auml;lfte ein Editor f&uuml;r den Eigenschafts-Typ. Wenn gew&uuml;nscht &auml;ndern Sie die Eigenschafts-Werte.
</p>

<p>
Einige Eigenschaften enthalten Referenzen auf andere Instanzen (z.B. enth&auml;lt HUSB die Referenz auf einen Ehemann and FAMS die Referenz zu der Familie eines Partners). Beim Doppelklicken auf solche Eigenschaften, wird zur Referenz gesprungen und die Anzeige wechselt von der Instanz zur Referenz.
</p>

</td><td>
  <blockquote> <img src="..\..\images\screenshots\edit1.png"></blockquote>

</td></tr></table>

<p>
Der Plus-Auswahlknopf in der Werkzeugleiste (siehe unten) erlaubt das
Hinzuf&uuml;gen einer neuen Eigenschaft. Eine neue Eigenschaft wird als 
Untereigenschaft zur gerade gew&auml;hlten Eigenschaft hinzugef&uuml;gt. Ein Dialog zeigt alle Gedcom-konformen Untereigenschaften an &#8211; w&auml;hlen Sie zum Einf&uuml;gen eine oder mehrere aus. Sie k&ouml;nnen auch Eigenschaften mit eigenen (nicht dem Gedcom-Standard entsprechend) Kennzeichen hinzuf&uuml;gen; seinen Sie jedoch sparsam damit, um nicht zu weit vom Standard abzuweichen.
</p>

<p>Verwenden Sie das <a href="..\concepts\context.html">Kontextmen&uuml;</a>, um komplexe Aktionen an Eigenschaften und Instanzen auszuf&uuml;hren. Versuchen Sie einen Rechtsklick auf einen der angezeigten Knoten, um die auszuf&uuml;hrenden Aktionen zu erkunden.
</p>

<h3><a name=toolbar>Werkzeugleiste</a></h3>

<p><blockquote>
<img src="..\..\images\screenshots\edit2.png"></blockquote>

<ol>
 <li>Eigenschaft zur ausgew&auml;hlten Eigenschaft hinzuf&uuml;gen (es
     wird ein Dialog angezeigt)</li>
 <li> ausgew&auml;hlte Eigenschaft l&ouml;schen</li>
 <li> ausgew&auml;hlte Eigenschaft nach oben verschieben</li>
 <li> ausgew&auml;hlte Eigenschaft nach unten verschieben</li>
 <li> zur vorigen angezeigten Instanz zur&uuml;ckkehren</li>
 <li> festhalten umschalten (h&auml;lt die derzeitige Instanz fest &#8211; es wird nicht der Auswahl in einer anderen Ansicht gefolgt) </li>
 <li> Ansicht schlie&szlig;en</li>
</ol>

<h3>Einstellungen</h3>

<p>Diese Ansicht bietet keine Einstellungsoptionen an.</p>

</body>

</html>
