<html>
<body>

<h2>
  Travailler avec les divers Fen&ecirc;tres de Visualisation
</h2>

<p>
 Une fois que vous avez ouvert un fichier contenant des donn&eacute;es 
 g&eacute;n&eacute;alogiques au format Gedcom (*.ged), &agrave; partir 
 du <a href="cc.html">Centre de Controle</a> vous pouvez ouvrir plusieurs 
 types de visualisation.
</p>

<p>
 Ces visualisations travaillent sur les m&ecirc;mes donn&eacute;es - cela veut dire que 
 <ul>
  <li>les changements effectu&eacute;s dans une fen&ecirc;tre seront 
  imm&eacute;diatement effectifs dans les autres fen&ecirc;tres pour le 
  m&ecirc;me fichier,
  <li>les &eacute;v&egrave;nements s&eacute;lectionn&eacute;s dans une 
  fen&ecirc;tre vont &ecirc;tre transmis aux autres fen&ecirc;tres pour 
  le m&ecirc;me fichier (*),
  <li>la fermeture d'un fichier entrainera imm&eacute;diatement la fermeture de 
  toutes les fen&ecirc;tres ouvertes sur ce fichier,
  <li><a href="./context.html">les menus contextuels</a> lient les actions 
  de tous les types de visualisation sur le m&ecirc;me fichier en un endroit
 </ul>
 <p align=right><font size=-2>
    * les changements dans la s&eacute;lection d'une fen&ecirc;tre peuvent 
    ne pas provoquer un changement dans une autre si cette derni&egrave;re 
    ne peut pas suivre la s&eacute;lection
 </font></p>
</p>

<p>
 Typically you will open one instance per type of view - not necessarily
 all but combinations that help to navigate and understand the underlying
 data. For example
 <ul>
  <li>Tree&Table View to browse the existing information
  <li>Table&Edit View to cleanup, catalog and edit the existing information
  <li>Report View to run reports on large files
 </ul>
</p>

<p>
 The combination is not limited and you'll soon get a feeling for which 
 combination of views fullfills your needs. The views will remember the 
 position and size of the enclosing windows so position them as required
 and they will pop-up at the same place next time. You can also open
 several instances of the same view to check out different angles - in
 that case they're numbered sequentially.
</p>

<p>
 Voici la liste des diff&eacute;rentes fen&ecirc;tres de visualisation &agrave; votre disposition:
  <BLOCKQUOTE>
   <img src="../images/views/Table.gif"     >&nbsp;<A href="./view/table.html"    >Tableau des Donn&eacute;es              </A><Br>
   <img src="../images/views/Tree.gif"      >&nbsp;<A href="./view/tree.html"     >Arbre G&eacute;n&eacute;alogique        </A><Br>
   <img src="../images/views/Timeline.gif"  >&nbsp;<A href="./view/timeline.html" >Chronologie des &Eacute;v&egrave;nements</A><Br>
   <img src="../images/views/Edit.gif"      >&nbsp;<A href="./view/edit.html"     >L'Editeur                               </A><Br>
   <img src="../images/views/Report.gif"    >&nbsp;<A href="./view/report.html"   >Les Rapports                            </A><Br>
   <img src="../images/views/Navigator.gif" >&nbsp;<A href="./view/navigator.html">Le Navigateur                           </A><Br>
   <img src="../images/views/Entity.gif"    >&nbsp;<A href="./view/entity.html"   >Visualisation d'une Entit&eacute;         </A>
  </BLOCKQUOTE>
 <p align=right><font size=-2>
   Veuillez suivre les liens pour avoir plus d'information sur chaque vue 
   individuellement.
 </font></p>
</p>

</body>
</html>
