<html>
<body>

<h2>Arbeiten mit Ansichten</h2>

<p>
Wenn Sie die <a href="./concepts\gedcom.html">Gedcom</a>-Datei (*.ged) im <a href="cc.html">Control Center</a> ge&ouml;ffnet haben, k&ouml;nnen Sie Ansichten &ouml;ffnen.
</p>

<p>Alle Ansichten arbeiten auf den gleichen Daten &#8211; dies bedeutet:

<ul>
 <li>&Auml;nderungen, die in einer Ansicht durchgef&uuml;hrt werden, werden sofort in anderen Ansichten der gleichen Datei wirksam</li>
 <li>Selektionen in einer Ansicht werden auch in anderen Ansichten der gleichen Datei wirksam * </li>
 <li>das Schlie&szlig;en der Datei, schlie&szlig;t alle Ansichten dieser Datei </li>
 <li><a href="./concepts\context.html">Kontextmen&uuml;s</a> f&uuml;r angezeigte Informationen bieten Aktionen in allen Ansichten an. </li>
</ul>
<p align=right><font size=-2>
*Eine Ver&auml;nderung in der Selektion einer Ansicht wird nur dann in anderen Ansicht wirksam,
wenn sie dort m&ouml;glich ist!</font></p>
</p>

<p>
Typischerweise werden Sie eine Instanz pro Ansichttyp &ouml;ffnen &#8211; Kombinationen
verschiedener Ansichten werden Ihnen helfen, durch die Daten zu navigieren und
sie zu verstehen. Zum Beispiel:

<ul>
 <li>Baum&amp;Tabellen-Ansicht, um durch bestehende Informationen zu bl&auml;ttern </li>
 <li>Tabellen&amp;Bearbeitungs-Ansicht, um bestehende Informationen zu bereinigen, zu katalogisieren und zu bearbeiten </li>
 <li>Report-Ansicht, um Reports auf gro&szlig;e Dateien anzuwenden</li>
</ul>
</p>

<p>
Die Kombinationen sind nicht begrenzt und Sie werden schnell ein Gef&uuml;hl daf&uuml;r entwickeln, welche Ansichten Ihre Bed&uuml;rfnisse erf&uuml;llen. Zu der Ansicht wird Position und Gr&ouml;&szlig;e des darstellenden Fensters gespeichert, so dass sie nach Bedarf angeordnet werden k&ouml;nnen und beim n&auml;chsten Programmstart wieder an der selben Stelle erscheinen. Sie k&ouml;nnen auch verschiedene Instanzen der gleichen Ansicht &ouml;ffnen, um unterschiedliche Blickwinkel auf die Daten zu haben &#8211; die Ansichten werden aufsteigend nummeriert.
</p>

<p>Hier ist die Liste aller Ansichten, die zur Verf&uuml;gung stehen: 

<blockquote><img src="../images/views/Table.gif">&nbsp;<a
href="./view/table.html">Tabellen-Ansicht </a><br>
<img src="../images/views/Tree.gif">&nbsp;<a href="./view/tree.html">Baum-Ansicht </a><br>
<img src="../images/views/Timeline.gif">&nbsp;<a href="./view/timeline.html">Zeitlinien-Ansicht
</a><br>
<img src="../images/views/Edit.gif">&nbsp;<a href="./view/edit.html">Bearbeitungs-Ansicht
</a><br>
<img border=0 width=16 height=16 id="_x0000_i1029"
src="../images/views/Report.gif">&nbsp;<a href="./view/report.html">Report-Ansicht
</a><br>
<img src="../images/views/Navigator.gif">&nbsp;<a href="./view/navigator.html">Navigator-Ansicht</a><br>
<img src="../images/views/Entity.gif">&nbsp;<a href="./view/entity.html">Instanz-Ansicht
</a></blockquote>

<p align=right><font size=-2>f&uuml;r mehr
Information zu den einzelnen Ansichten folgen Sie bitte den Links </font></p>
</p>

</body>
</html>