<html>
<body>

<h2>Arbeiten mit dem Kontextmen&uuml;</h2>

<p>
Ein wichtiger Punkt bei der Arbeit mit GenJ ist das Verwenden von Kontextmen&uuml;s. Ein Rechtsklick <font size=-2>(Bei Ihrer Plattform kann eine andere Maus-Aktion erforderlich sein, um das Kontextmen&uuml; aufzurufen)</font> auf angezeigte Information in einer <a href="..\views.html">Ansicht</a> wird Ihnen zeigen, welche Aktionen Sie ausf&uuml;hren k&ouml;nnen.
</p>

<p>
Die Struktur des Kontextmen&uuml;s ist immer gleich: an der ersten Stelle erscheint ein zur angeklickten Eigenschaft geh&ouml;riges Untermen&uuml;. Dann folgen weitere Untermen&uuml;s, die den Kontext erweitern.
</p>

<p>
Im folgendem Beispiel wird das Kontextmen&uuml; f&uuml;r die Namens-Eigenschaft angezeigt. Das erste Untermen&uuml; zeigt die Eigenschaft und den dazugeh&ouml;rigen Aktionen, das zweite Untermen&uuml; zeigt die Instanz (hier ein Individuum), die der Eigenschaft zugeordnet ist, das dritte Untermen&uuml; zeigt die Datei (Gedcom), die der Instanz zugeordnet ist. 

<blockquote>
<img src="..\..\images\screenshots\context1.png"></blockquote>

Das Untermen&uuml; f&uuml;r das Individuum 'I008' erm&ouml;glicht die folgenden Aktionen:

<ul>
 <li>Kind hinzuf&uuml;gen &#8211; ein Kind
     (und wenn n&ouml;tig eine Familie) f&uuml;r I008 </li>
 <li>Partner hinzuf&uuml;gen &#8211; einen Partner (und wenn n&ouml;tig eine Familie) f&uuml;r I008 </li>
 <li>Geschwister hinzuf&uuml;gen &#8211; Geschwister (und wenn n&ouml;tig Eltern) f&uuml;r I008 </li>
 <li>Bibliothek hinzuf&uuml;gen &#8211; ein externe Bibliothek mit Informationen zu I008 </li>
 <li>Multimediaobjekt hinzuf&uuml;gen &#8211; ein Objekt mit bin&auml;ren Daten</li>
 <li>Notiz hinzuf&uuml;gen &#8211; eine Notiz zu I008 </li>
 <li>&Uuml;bermittler hinzuf&uuml;gen &#8211; eine Person welche Informationen &uuml;bermittelt hat zu I008 </li>
 <li>Quelle hinzuf&uuml;gen &#8211; die Quelle der Informationen &uuml;ber I008 </li>
 <li>Assoziation hinzuf&uuml;gen &#8211; eine Beziehung zu einem anderen Individuum </li>
 <li>L&ouml;schen &#8211; Entfernen der Instanz I008 </li>
</ul>
</p>

<p>
Das n&auml;chste Beispiel zeigt ein Kontextmen&uuml; f&uuml;r eine Eigenschaft, wobei auch die Aktionen angezeigt werden (erstes Untermen&uuml;). </p>

<blockquote><img src="..\..\images\screenshots\context3.png"></blockquote>

M&ouml;liche Aktionen sind:

<ul>
 <li>Notiz hinzuf&uuml;gen &#8211; diese Notiz
     kann Daten zur n&auml;heren Beschreibung der Geburt enthalten</li>
 <li>Quelle hinzuf&uuml;gen &#8211; diese Quelle
     kann festhalten, woher die Informationen zur Geburt stammen </li>
 <li>Multimediaobjekt hinzuf&uuml;gen
     &#8211; dieses Objekt kann bin&auml;re Daten bzgl. der Geburt abspeichern</li>
 <li>L&ouml;schen &#8211; Informationen &uuml;ber
     die Geburt (Eigenschaft BIRT) komplett l&ouml;schen </li>
</ul>
</p>

<p>
Zum Schluss ein Beispiel das veranschaulicht, wie der Inhalt von Kontextmen&uuml;s dynamisch erstellt wird. Die folgende Logik wird angewendet, wenn das Men&uuml; in der Baum-Ansicht bei einem Rechtsklick auf einem Knoten erstellt wird:

<ul>
 <li>Der Kontext, auf den geklickt wurde, ist keine Eigenschaft sondern eine Instanz (hier Individuum I008). Somit ist das erste Untermen&uuml; f&uuml;r ein Individuum </li>
 <li>Die Ansicht, in der das Kontextmen&uuml; aufgerufen wurde, &#8211; <a href="..\view\tree.html">Baum-Ansicht</a> &#8211; hat einen ansichts-spezifischen Eintrag zum Untermen&uuml; hinzugef&uuml;gt, die Aktion <em>Bookmark hinzuf&uuml;gen.</em> </li>
</ul>

<blockquote><img src="..\..\images\screenshots\context2.png"></blockquote>

Die Aktionen, die im ge&ouml;ffneten Untermen&uuml; angezeigt werden, erlauben
das Hinzuf&uuml;gen einer neuen <a href="..\entities.html">Instanz</a> in der Datei example.ged.
Es ratsam, auf vorhandenen Daten aufzubauen statt neue bzw. alleinstehende Instanzen wie Individuen oder Familien hinzuzuf&uuml;gen. Um verwandte/referenzierte Instanzen zu erzeugen, benutzen Sie das Untermen&uuml; f&uuml;r Eigenschaften oder Instanzen wie oben beschrieben. </p>

</body>

</html>
