<html>
<body>


<h2>Gedcom</h2>

<p>
Gedcom ist ein Standard f&uuml;r den Austausch von genealogischen Informationen in elektronischer Form. Dies ist wichtig, da der Kern von GenJ auf diesem Standard aufbaut. Diese Tatsache ist nicht unbedingt an der Oberfl&auml;che sichtbar, aber das Wissen hilft beim Verst&auml;ndnis der Arbeitsweise von GenJ.
</p>

<p>
Generell sind alle Gedcom-Informationen hierarchisch strukturiert. Eine
Instanz (Individuum, Familie, Media, Notiz, Quelle, &Uuml;bermittler oder Bibliothek) besteht aus einem Baum von Eigenschaften ohne Limitierung hinsichtlich der Tiefe oder der Anzahl der Stufen. Es gibt f&uuml;r jede Instanz eine gro&szlig;e Menge von wohldefinierten Eigenschaften (wie beispielsweise Datum, Name, Geschlecht, etc.), wobei jede
Eigenschaft Werte beinhaltet, die von Anwendungen mit Gedcom-Unterst&uuml;tzung verarbeitet werden k&ouml;nnen.
</p>

<p>Eine Gedcom-Datei ist prinzipiell eine einfache Textdatei mit einer Eigenschaft pro Zeile. Es gibt keine Notation f&uuml;r Abschluss oder Ende von Kennzeichnungselementen (wie beispielsweise in XML) &#8211; Zeilen besitzen stattdessen unterschiedliche Markierungsebenen. Eine Ebene wird durch eine Zahl spezifiziert, danach folgt ein Kennzeichnungselement zur Identifizierung der Eigenschaft. Hier ein Beispiel f&uuml;r einen Datensatz eines Individuums (unterschiedliche Ebenen sind nur zur besseren Lesbarkeit im Text einger&uuml;ckt):
</p>

<blockquote>
<pre>
0 INDI @I001@
  1 NAME Nils /Meier/
  1 SEX M
  1 BIRT
    2 DATE 25 May 1970
    2 PLAC Rendsburg, Germany
  1 GRAD
    2 DATE 10 Dec 1996 
    2 PLAC Friedrich Wilhelm University Bonn
    2 TYPE Diplom Informatiker
  1 RESI
    2 DATE FROM Jul 1999 TO DEC 2000
    2 ADDR 202-1241 Kilborn Place
      3 CONT Ontario, Canada
      3 CITY Ottawa
      3 POST K1H1A5    
  1 NOTE @N003@
</pre>
</blockquote>

<p>
Die M&auml;chtigkeit von GenealogyJ besteht darin, dass es die Bearbeitung von verschachtelten Information in hierarchischer Form gestattet. Definierte Eigenschaften werden entsprechend ihrem Typ behandelt und k&ouml;nnen ebenso bearbeitet werden &#8211; Sie m&uuml;ssen sich
keine Gedanken um die Textdarstellung machen. GenJ verwaltet implizit die Eigenschaften, die andere
Instanzen referenzieren k&ouml;nnen. Daher ist die referenzielle Integrit&auml;t und die einfache Bildung von Beziehungen (wie das Hinzuf&uuml;gen eines Kindes zu einem Elternteil oder das Hinzuf&uuml;gen eines Partners zu einem Individuum) sichergestellt. GenJ wendet den Gedcom-Standard an und schl&auml;gt beim Hinzuf&uuml;gen optional Untereigenschaften vor.
</p>

<p>
Der momentan unterst&uuml;tzte Gedcom-Standard, ist die <a href="http://www.gendex.com/gedcom55/55gctoc.htm">Version 5.5</a>. Wenn Sie
mehr &uuml;ber Gedcom erfahren wollen, dann sehen Sie sich die Spezifikation an &#8211; es
ist eine andauerndes Bestreben GenJ so eng wie m&ouml;glich am Standard auszurichten.
</p>

</body>

</html>