<HTML>
<BODY>

<h2><a href="../views.html">Vues</a> - La Localisation G&eacute;ographique</h2>

<p>
  <blockquote>
    <img src="../images/screenshots/geoview1.jpg">
  </blockquote>
</p>

<p>
 Cette fen&ecirc;tre va vous permettre de localiser les gens qui 
 sont pr&eacute;sents dans votre arbre g&eacute;n&eacute;alogique.<br>
 Une fois que vous aurez import&eacute; les cartes correspondantes 
 (<a href="#_geo_import_data_">voir plus loin</a> dans les param&egrave;tres pour la proc&eacute;dure), 
 vous pourrez en cliquant sur le nom d'une ville qui appara&icirc;t 
 sur la carte, voir dans la fen&ecirc;tre de droite la liste se 
 centrer sur ladite ville, et en cliquant sur le signe "+" &agrave; 
 c&ocirc;t&eacute; du nom de cette m&ecirc;me ville, visualiser tous 
 les &eacute;v&egrave;nements qui se sont pass&eacute;s dans cette 
 localit&eacute;.<br>
 A l'inverse, si vous cliquez sur le nom d'une ville dans la liste 
 d&eacute;roulante, la carte va se centrer sur cette ville et un 
 cercle rouge vous permettra de mieux voir o&ugrave; elle est.
</p>

<p>
 Maintenant, vous remarquerez tr&eacute;s vite, que certaines 
 localit&eacute;s, sont recens&eacute;es comme &eacute;tant 
 "<em>inconnu</em>" dans la liste. C'est normal, d'une part la base 
 n'est pas compl&egrave;te, et d'autre part, un certain nombre de 
 villages n'existent plus, ou des noms ont pu changer. Ne vous 
 effrayez pas. Cette fen&ecirc;tre dispose d'un moyen pour 
 compl&eacute;ter, modifier la base de donn&eacute;es. Une chose est 
 &agrave; noter, toutes les modifications sont enregistr&eacute;es 
 dans un fichier externe &agrave; la base de donn&eacute;es, donc 
 vous ne risquez pas de les perdre, si vous t&eacute;l&eacute;chargez 
 plus tard une nouvelle mouture de la base de donn&eacute;es plus 
 &agrave; jour.<br>
 Donc pour en revenir aux modifications qu'on peut y apporter, il vous 
 suffit de cliquer sur le bouton "<b>Modifier</b>" qui se trouve en 
 bas de la liste d&eacute;roulante.<br>
 Une nouvelle fen&ecirc;tre va s'ouvrir. L&agrave; plusieurs 
 possibilit&eacute;s ; D'une part vous pouvez voir plusieurs fois le 
 nom de la ville qui vous int&eacute;resse, mais ce nom existe dans 
 plusieurs d&eacute;partements, r&eacute;gions, voir pays. Choisissez 
 celui qui vous concerne. De cette mani&egrave;re vous ne risquez pas 
 de voir votre arbre se centrer sur Paris au Texas (USA), mais bien 
 &agrave; l'endroit qu'on conna&icirc;t en France si jamais vous aviez 
 charg&eacute; et la carte de France, et la carte du Texas (USA) <i>(un 
 petit sourire n'a jamais fait de mal dans un document d'aide, non)</i>. 
 D'autre part, il est possible que votre localit&eacute; n'existe pas 
 dans la base ; il vous suffit alors de rajouter les coordonn&eacute;es 
 g&eacute;ographiques (latitude et longitude) et de cliquez sur 
 "<b>M&eacute;moriser les Coordonn&eacute;es</b>" 
</p>

<p>
 Dernier d&eacute;tail, les signes "<b>+</b>" et "<b>-</b>" qui se 
 trouvent sous la liste des localit&eacute;s, vous permettent 
 d'expanser ou de concentrer toutes les villes de la liste. Essayez, 
 vous comprendrez facilement de quoi il retourne.
</p>

<br>

<h3><u>Barre d'Outils</u></h3>
  <blockquote><img src="../../images/screenshots/geo2.png"></blockquote>
 <ol>
  <li>Choisir une nouvelle Carte.</li>
  <li>Revenir &agrave; la taille initiale de la Carte.</li>
  <li>Activer/D&eacute;sactiver le mode Zoom.</li>
  <li>Ouvrir la fen&ecirc;tre des Param&eacute;trages.</li>
  <li>Fermer la fen&ecirc;tre de Localisation G&eacute;ographique.</li>
 </ol>

<h3><u>Param&egrave;trages</u></h3>
 Les param&egrave;tres de cette vue sont regroup&eacute;s en deux 
 actions successives&nbsp;:
 <ol>
  <li>
<a name="_geo_import_data_"></a>
  D'une part, vous devez commencer par importer une base de 
  donn&eacute;es. Donc vous devez cliquer sur "<b>Importer</b>", et 
  choisir dans le menu d&eacute;roulant, le pays concern&eacute; 
  par votre fichier gedcom. Il est possible que vous ayez plusieurs 
  pays, donc vous devez faire cette importation pour chacun d'eux. 
  Ensuite cliquez sur "<b>OK</b>", et logiquement le pays en question 
  devrait venir se mettre dans le listing de l'index 
  g&eacute;ographique. N'oubliez pas qu'il vous faut une connection 
  internet.
  </li>
  <li>
  D'autre part, une fois que cela est fait vous pouvez monter ou 
  descendre (voir effacer) la base de donn&eacute;es qui 
  pr&eacute;sente le plus d'int&eacute;r&ecirc;t pour votre 
  g&eacute;n&eacute;alogie. Le fait de mettre un fichier en premier 
  permettra au programme de trouver imm&eacute;diatement les 
  donn&eacute;es dont il a besoin plut&ocirc;t que d'avoir &agrave; 
  scanner toute la base. Ainsi si vous avez trois pays, l'Allemagne, 
  la Belgique, et la France, et si vous les mettez dans cet ordre, 
  alors que la quasi totalit&eacute; de vos naissances, mariages, 
  d&eacute;c&egrave;s se situent en France, il faudra avant de trouver 
  la bonne ville, que le programme scanne toutes les localit&eacute;s 
  de l'Allemagne, de la Belgique et enfin de la France pour la 
  trouver.<br>
  Bien entendu, une fois que vous avez fini, cliquez sur 
  "<b>Appliquer</b>", puis "<b>Fermer</b>".
  </li>
 </ol>

<br>

<p>
<b><u>Remarque</u> :</b><br>
Il est possible de cr&eacute;er ses propres cartes. Par exemple celle 
que vous voyez sur cette page est quelque chose que j'ai 
cr&eacute;&eacute;e de toutes pi&egrave;ces. Pour le moment aucun 
serveur n'h&eacute;berge les cartes qui ont pu &ecirc;tre faites, 
mais cela pourrait venir dans l'avenir pour permettre &agrave; tout 
le monde de profiter du travail des autres. N'h&eacute;sitez pas 
&agrave; apporter votre contribution dans ce domaine &eacute;galement. 
Merci.
</p>

<br>

</BODY>
</HTML>
