<html>
<body>

<h2>
  L'Arbre G&eacute;n&eacute;alogique
</h2>

<p>
Il n'est pas surprenant que les donn&eacute;es g&eacute;n&eacute;alogiques 
forment un arbre - un arbre g&eacute;n&eacute;alogique. GenJ cherche l'origine 
de cet arbre et visualise tous les anc&ecirc;tres et tous les descendants. 
Une exception cependant&nbsp;: seuls les descendants directs avec leurs 
conjoints et seuls les anc&ecirc;tres directs avec leurs conjoints sont 
visualis&eacute;s. Ainsi, si votre grand-p&egrave;re a un fr&egrave;re, ce 
dernier ne sera visible qu'&agrave; la condition de faire de lui (le 
fr&egrave;re de votre grand-p&egrave;re) ou de l'un de ses anc&ecirc;tres, 
l'origine de l'arbre.
</p>

<p>
Vous pouvez parcourir l'arbre en faisant d&eacute;filer et en s&eacute;lectionnant 
des individus ou des familles. Chaque fois que vous s&eacute;lectionnez une 
de ces entit&eacute; un message est envoy&eacute; &agrave; 
<a href="edit.html">la Fen&ecirc;tre d'Edition</a> pour la visualiser. En 
double-cliquant sur une entit&eacute;, celle-ci devient l'origine de l'arbre. 
Apr&egrave;s un court calcul l'arbre se visualise dans sa nouvelle disposition. 
Si vous voulez limiter l'information pr&eacute;sent&eacute;e vous pouvez supprimer 
des arbres secondaires en cliquant sur les petits signes moins(-) / plus(+) 
attach&eacute;s &agrave; la ligne reliant famille et enfant.
</p>

<p>
La barre d'outils en bas &agrave; droite offre des fonctions 
suppl&eacute;mentaires&nbsp;:
<ol>
<li>Vous pouvez choisir une entit&eacute; &agrave; partir d'une liste de
signets (voir <a href="settings/tree.html">Fen&ecirc;tre des Param&egrave;trages</a>) 
et l'arbre aura comme origine cette entit&eacute;
<li>Vous pouvez choisir un niveau de zoom en cliquant sur l'icone zoom (un 
double-clic permet de revenir &agrave; 100%)
<li>Le petit bouton avec la loupe ouvre/ferme une fen&ecirc;tre avec une 
vue d'ensemble de l'arbre permettant un navigation plus ais&eacute;e &agrave; 
travers une grande structure (d&eacute;placez en cliquant la zone gris&eacute;e)
<li>Le bouton le plus &agrave; droite ouvre la <a href="settings/tree.html">
Fen&ecirc;tre de Param&egrave;trages&nbsp;</a> pour la vue en cours.
</p>

</body>
</html>
