<html>
<body>


<h2>
  Famille
</h2>


<p>
La deuxi&egrave;me entit&eacute; importante est la famille. Elle lie des 
individus et est trait&eacute;e comme une entit&eacute; s&eacute;par&eacute;e 
pour tenir compte des cas, o&ugrave; l'un des conjoints, voir m&ecirc;me les 
deux, est inconnu.
</p>

<p>
Lorsque vous cr&eacute;ez une entit&eacute; en cliquant sur 
<img src="../../images/Fam.gif">, GenJ va vous demander quelques renseignements 
primordiaux. Ensuite vous allez alors pouvoir sp&eacute;cifier une relation 
&agrave; l'&eacute;gard d'une autre entit&eacute; dans votre fichier. Simplement 
cliquez sur un individu dans la visualisation de 
<a href="../view/tree.html">l'Arbre g&eacute;n&eacute;alogique</a> 
ou dans la <a href="../view/table.html">Table des Donn&eacute;es</a>
  et vous pouvez  choisir &agrave; partir des boutons radio si cet individu
est parent ou enfant (&agrave; condition qu'il ne soit pas d&eacute;j&agrave; 
enfant dans une autre famille) dans cette famille. Faites votre choix et cliquez 
sur Cr&eacute;er.
</p>

<p>
En &eacute;ditant une Famille dans la 
<a href="../view/edit.html">Fen&ecirc;tre d'&eacute;dition</a> 
vous devez coller le plus pr&egrave;s possible &agrave; la norme Gedcom. Une 
famille typique comprend les informations suivantes&nbsp;:
<PRE>
@F001@ FAM
 WIFE @I002@
 HUSB @I001@
 MARR
  DATE 1964
  PLAC Flagstaff, USA
 CHIL @I004@
 CHIL @I005@
 CHIL @I008@
</PRE>
</p>

<p>
Parcourez les propri&eacute;t&eacute;s de vos familles et modifiez les. Quand 
vous ajoutez de nouvelles propri&eacute;t&eacute;s, choisissez les dans la 
liste pr&eacute;d&eacute;finie ou si cela s'av&egrave;re n&eacute;cessaire et 
que vous ayez des besoins particuliers, ajoutez de nouvelles &eacute;tiquettes 
de propri&eacute;t&eacute;s.
</p>

<p>
Une fonction importante de Gedcom est sa capacit&eacute; &agrave; cr&eacute;er 
des liens entre des entit&eacute;s. Normalement les familles ne sont pas 
d&eacute;sunies - elles comprennent un mari, une femme ou des enfants. 
A chaque fois que vous cr&eacute;ez une nouvelle Famille associ&eacute;e 
&agrave; des personnes, celles-ci sont li&eacute;es par le biais de 
propri&eacute;t&eacute;s. Ces propri&eacute;t&eacute;s pour les familles sont 
HUSB (le mari), WIFE (la femme) ou CHIL (l'enfant). Les propri&eacute;t&eacute;s 
se rattachent &agrave; l'individu par son id. Vous pouvez explorer les relations 
entre les familles et les individus en suivant ces liens. Soyez prudent quand 
vous supprimez ou cr&eacute;ez de nouveaux liens - avoir une vue d'ensemble de 
l'int&eacute;grit&eacute; 
r&eacute;f&eacute;rentielle n'est pas facile :).
</p>

<p>
Prenons &agrave; nouveau l'exemple donn&eacute; &agrave; la section relative 
&agrave; l'<a href="indi.html">Individu</a>&nbsp;:&nbsp;Vous avez votre arbre 
g&eacute;n&eacute;alogique et d&eacute;couvrez qu'un anc&ecirc;tre de la soeur 
d'une &eacute;pouse a &eacute;pous&eacute; le fr&egrave;re de celui-ci. Tous 
ces individus sont d&eacute;j&agrave; dans votre arbre! Vous pouvez maintenant 
cr&eacute;er une nouvelle famille pour ce lien nouvellement d&eacute;couvert. 
Mais vous  ne voulez pas cr&eacute;er un nouvel individu - vous voulez lier 
des entit&eacute;s existantes! La solution : Choisissez la nouvelle famille 
pour le fr&egrave;re de votre anc&ecirc;tre et ajoutez-y une propri&eacute;t&eacute; 
WIFE. Changez-la alors pour pointer sur la soeur en entrant son ID. En cliquant 
sur le bouton de liaison, une propri&eacute;t&eacute; FAMS sera automatiquement 
ajout&eacute;e &agrave; la soeur. La boucle est boucl&eacute;e.
</p>


</body>
</html>
